In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("iris.csv")

In [23]:
df.describe().round(3)

       sepal_length  sepal_width  petal_length  petal_width
count       150.000      150.000       150.000      150.000
mean          5.843        3.054         3.759        1.199
std           0.828        0.434         1.764        0.763
min           4.300        2.000         1.000        0.100
25%           5.100        2.800         1.600        0.300
50%           5.800        3.000         4.350        1.300
75%           6.400        3.300         5.100        1.800
max           7.900        4.400         6.900        2.500

In [4]:
df.describe(include='object')

       species
count      150
unique       3
top     setosa
freq        50

In [5]:
iris_groupby=df.groupby(["species"])

In [6]:
iris_groupby.mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.418         1.464        0.244
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [7]:
iris_groupby.median()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.0          3.4          1.50          0.2
versicolor           5.9          2.8          4.35          1.3
virginica            6.5          3.0          5.55          2.0

In [22]:
iris_groupby.std().round(3)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             0.352        0.381         0.174        0.107
versicolor         0.516        0.314         0.470        0.198
virginica          0.636        0.322         0.552        0.275

In [9]:
iris_groupby.min()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               4.3          2.3           1.0          0.1
versicolor           4.9          2.0           3.0          1.0
virginica            4.9          2.2           4.5          1.4

In [10]:
iris_groupby.max()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.8          4.4           1.9          0.6
versicolor           7.0          3.4           5.1          1.8
virginica            7.9          3.8           6.9          2.5

In [11]:
iris_groupby.quantile()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.0          3.4          1.50          0.2
versicolor           5.9          2.8          4.35          1.3
virginica            6.5          3.0          5.55          2.0

In [12]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [13]:
df['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [16]:
df.nunique()

sepal_length    35
sepal_width     23
petal_length    43
petal_width     22
species          3
dtype: int64

In [19]:
iris_groupby.count()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa                50           50            50           50
versicolor            50           50            50           50
virginica             50           50            50           50

In [41]:
print("Setosa Count:",df.loc[df['species']=='setosa','species'].count())
print("Versicolor Count:",df.loc[df['species']=='versicolor','species'].count())
print("Virginica Count:",df.loc[df['species']=='virginica','species'].count())

Setosa Count: 50
Versicolor Count: 50
Virginica Count: 50

In [42]:
print("SETOSA")
df[df['species']=='setosa'].std().round(3)

SETOSA

/tmp/ipykernel_7050/686317599.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df[df['species']=='setosa'].std().round(3)

sepal_length    0.352
sepal_width     0.381
petal_length    0.174
petal_width     0.107
dtype: float64

In [43]:
print("VERSICOLOR")
df[df['species']=='versicolor'].std().round(3)

VERSICOLOR

/tmp/ipykernel_7050/986789431.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df[df['species']=='versicolor'].std().round(3)

sepal_length    0.516
sepal_width     0.314
petal_length    0.470
petal_width     0.198
dtype: float64

In [44]:
print("VIRGINICA")
df[df['species']=='virginica'].std().round(3)

VIRGINICA

/tmp/ipykernel_7050/4059921305.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df[df['species']=='virginica'].std().round(3)

sepal_length    0.636
sepal_width     0.322
petal_length    0.552
petal_width     0.275
dtype: float64